import React from "react";
import {Box, ScrollArea} from "@mantine/core";
import {TermOfUseBoxStyles} from "@components/common/other/MyModals/TermsOfUseModal/TermOfUseBox/styles";

export const TermOfUseBox: React.FC = () => {
    const {classes} = TermOfUseBoxStyles();

    return (
        <Box component={ScrollArea} className={classes.boxForModal} p={5}>
            Правила пользования Сайтом ВКонтакте
            Добро пожаловать на Сайт ВКонтакте, интернет-ресурс, который помогает вам поддерживать связь с вашими
            старыми и новыми друзьями. Сайт ВКонтакте (vk.com, vk.ru) ) – это сетевой проект, объединяющий людей на
            основании мест учебы или работы.

            Вы также можете ознакомиться с Правилами защиты информации о пользователях на Сайте VK.com.

            Администрация Сайта предоставляет вам доступ к использованию Сайта ВКонтакте и его функциональности на
            условиях, являющихся предметом настоящих Правил пользования Сайтом ВКонтакте. В этой связи вам необходимо
            внимательно ознакомиться с условиями настоящих Правил, которые рассматриваются Администрацией Сайта как
            публичная оферта в соответствии со ст. 437 Гражданского кодекса Российской Федерации.


            1. Термины, используемые в настоящих Правилах

            1.1. Сайт ВКонтакте (или Сайт) – социальная сеть, известная под именем «ВКонтакте», размещённая на сайте в
            сети Интернет по адресу: VK.com, VK.ru (включая все уровни указанных доменов, как функционирующие на дату
            принятия Пользователем настоящих Правил, так и запускаемые и вводимые в эксплуатацию в течение всего срока
            его действия) и доступная Пользователю через сайт, мобильную версию сайта, приложения и иные ресурсы,
            представляющая собой результат интеллектуальной деятельности в форме программы для ЭВМ. Социальная сеть
            представлена в объективной форме совокупностью данных и команд, и порождаемых аудиовизуальных отображений
            (включая входящие в её состав графические изображения и пользовательский интерфейс), (далее – данные и
            команды), предназначенных для функционирования ЭВМ и мобильных устройств в целях получения определённого
            результата в виде организации функциональности социальной сети. Совокупность данных и команд состоит из
            активированных и неактивированных данных и команд.
            1.2. Неактивированные данные и команды – данные, команды и порождаемые аудиовизуальные отображения,
            позволяющие увеличить количество виртуальных ценностей, используемых в рамках функциональных возможностей
            Сайта. Условия предоставления Администрацией Пользователю права на использование неактивированных данных и
            команд определены в лицензионном соглашении, являющемся неотъемлемой частью настоящих Правил, действующая
            редакция которого располагается в свободном доступе в сети Интернет по адресу: http://vk.com/licence,
            заключаемом Администрацией Сайта с Пользователем.


            2. Статус Правил пользования Сайтом ВКонтакте

            2.1. Настоящие Правила пользования Сайтом ВКонтакте (ранее и далее – Правила) разработаны Администрацией
            Сайта и определяют условия использования и развития Сайта, его сервисов, а также права и обязанности его
            Пользователей и Администрации. Правила распространяются также на отношения, связанные с правами и интересами
            третьих лиц, не являющимися Пользователями Сайта, но чьи права и интересы могут быть затронуты в результате
            действий Пользователей Сайта.
            2.2. Настоящие Правила являются юридически обязательным соглашением между Пользователем и Администрацией
            Сайта, предметом которого является предоставление Администрацией Сайта Пользователю доступа к использованию
            Сайта и его функциональности. Помимо настоящих Правил, к соглашению между Пользователем и Администрацией
            Сайта относятся все специальные документы, регулирующие предоставление доступа к использованию отдельных
            функциональных возможностей Сайта (в том числе его неактивированных данных, команд и сервисов), размещённого
            в соответствующих разделах Сайта и/или в сервисах на Сайте.
            2.3. Пользователь обязан полностью ознакомиться с настоящими Правилами до момента регистрации на Сайте.
            Регистрация Пользователя на Сайте означает полное и безоговорочное принятие Пользователем настоящих Правил в
            соответствии со ст. 438 Гражданского кодекса Российской Федерации.
            2.4. Настоящие Правила могут быть изменены и/или дополнены Администрацией Сайта в одностороннем порядке с
            уведомлением в течение 3 (трёх) рабочих дней со дня внесения изменений и/или дополнений. Настоящие Правила
            являются открытым и общедоступным документом. Действующая редакция Правил располагается в сети Интернет по
            адресу: http://vk.com/terms. Администрация Сайта рекомендует Пользователям регулярно проверять условия
            настоящих Правил на предмет их изменения и/или дополнения. Продолжение использования Сайта Пользователем
            после внесения изменений и/или дополнений в настоящие Правила означает принятие и согласие Пользователя с
            такими изменениями и/или дополнениями.


            3. Статус Сайта ВКонтакте

            3.1. Права на Сайт в целом и на использование сетевого адреса (доменного имени) http://vk.com принадлежат
            Администрации Сайта. Последняя предоставляет доступ к Сайту всем заинтересованным лицам в соответствии с
            настоящими Правилами и действующим законодательством Российской Федерации.

            3.2. Настоящими Правилами установлены условия, в соответствии с которыми права на использование информации и
            результатов интеллектуальной деятельности (включая, но не ограничиваясь литературными, музыкальными,
            аудиовизуальными произведениями и фонограммами, произведениями графики и дизайна, фотографическими
            произведениями, программами для ЭВМ) в составе отдельных разделов Сайта, могут принадлежать Пользователям
            Сайта и иным лицам, самостоятельно создавшим и/или разместившим указанные объекты на Сайте без
            непосредственного участия Администрации Сайта.


            4. Администрация Сайта ВКонтакте

            4.1. Под Администрацией Сайта ВКонтакте (ранее и далее – Администрация Сайта или Администрация) в настоящих
            Правилах и иных специальных документах, размещённых на Сайте, понимается Общество с ограниченной
            ответственностью «В Контакте», юридическое лицо, созданное по законодательству Российской Федерации и
            зарегистрированное по адресу: 191024, Санкт-Петербург, ул. Херсонская, д. 12-14, литер А, помещение 1-Н.
            4.2. Обращения, предложения и претензии физических и юридических лиц к Администрации Сайта в связи с
            настоящими Правилами и всеми вопросами по функционированию Сайта, нарушениями прав и интересов третьих лиц
            при его использовании, а также для запросов уполномоченных законодательством Российской Федерации лиц могут
            быть направлены на почтовый адрес ООО «В Контакте», указанный в п. 4.1. настоящих Правил. Администрация
            Сайта приложит усилия к тому, чтобы рассмотреть обращения, претензии в её адрес в течение 30 календарных
            дней, если иной срок не предусмотрен законодательством Российской Федерации.
            4.3. В отношении функционирования и развития Сайта Администрация руководствуется законодательством
            Российской Федерации, настоящими Правилами и иными специальными документами, которые разработаны или могут
            быть разработаны и приняты Администрацией Сайта в целях регламентации предоставления Пользователям доступа к
            отдельной функциональности Сайта.
            4.4. Никакие положения настоящих Правил не предоставляют Пользователю право на использование фирменного
            наименования, товарных знаков, доменных имен и иных отличительных знаков Администрации Сайта. Право на
            использование фирменного наименования, товарных знаков, доменных имен и иных отличительных знаков
            Администрации Сайта может быть предоставлено исключительно по письменному соглашению с Администрацией Сайта.


            5. Регистрация на Сайте ВКонтакте и статус Пользователя

            5.1. Сайт ВКонтакте является Сервисом Экосистемы VK. Регистрация Пользователя на Сайте является бесплатной,
            добровольной и производится посредством инструмента VK ID. Регистрация и/или авторизация на Сайте
            посредством VK ID означает согласие с Пользовательским соглашением Экосистемы VK, которое размещено в
            открытом доступе в сети Интернет по адресу https://id.vk.com/terms, и Политикой конфиденциальности
            Экосистемы VK, которая размещена в открытом доступе в сети Интернет по адресу https://id.vk.com/privacy.

            5.2. Пользователем Сайта является физическое лицо, зарегистрированное на Сайте в соответствии с
            установленным настоящими Правилами порядком, достигшее возраста, допустимого в соответствии с
            законодательством Российской Федерации для акцепта настоящих Правил, и обладающее соответствующими
            полномочиями (ранее и далее – Пользователь).

            5.3. При регистрации на Сайте Пользователь обязан предоставить Администрации Сайта необходимую достоверную и
            актуальную информацию для формирования персональной страницы Пользователя, включая уникальные для каждого
            Пользователя логин и пароль доступа к Сайту, а также фамилию и имя. Регистрационная форма Сайта может
            запрашивать у Пользователя дополнительную информацию.

            5.4. Пользователь несет ответственность за достоверность, актуальность, полноту и соответствие
            законодательству Российской Федерации предоставленной при регистрации информации и ее чистоту от претензий
            третьих лиц.

            5.5. После предоставления информации, указанной в п. 5.3. настоящих Правил, Пользователю необходимо пройти
            ряд удостоверительных процедур, а именно, (а) подтвердить регистрацию путем распознания автоматизированного
            теста, предназначенного для различия компьютеров и людей («капчи»); (б) подтвердить регистрацию путем
            введения в соответствующую форму на Сайте кода, полученного Пользователем в виде sms-сообщения от
            Администрации Сайта на мобильный телефон Пользователя, номер которого предоставляется самим Пользователем. В
            случае верного последовательного выполнения всех регистрационных действий на Сайте создается персональная
            страница Пользователя, имеющая сетевой адрес вида http://vk.com/id[номер]. Пользователь вправе присвоить
            персональной странице короткое (поддоменное) имя, заменяющее порядковый номер id при адресации в сети
            Интернет. В качестве поддоменного имени не могут быть выбраны слова и наименования, использование которых
            запрещено в соответствии с настоящими Правилами, действующим законодательством Российской Федерации и
            международными правовыми актами, в том числе, но не ограничиваясь, нецензурная лексика, наименования,
            зарегистрированные как товарные знаки (вне зависимости от класса МКТУ), фирменные наименования и
            коммерческие обозначения, если пользователю не принадлежат исключительные права на них. В случае обнаружения
            нарушения данных условий Администрация вправе запретить Пользователю использование присвоенного им
            поддоменного имени, в том числе, если применимо, передать право его использования надлежащему лицу
            (представителю правообладателя).

            5.6. При регистрации Пользователь соглашается с настоящими Правилами и принимает на себя указанные в них
            права и обязанности, связанные с использованием и функционированием Сайта. Пользователь соглашается на
            получение посредством сервисов Администрации Сайта и/или сервисов третьих лиц электронных сообщений, sms и
            иных видов рассылок информационного, в т.ч. рекламно-информационного, содержания, в том числе от партнеров
            Администрации Сайта. Право использования неактивированных данных и команд предоставляется Пользователю при
            выполнении дополнительно к указанному выше условий лицензионного соглашения (см. п. 1.2. настоящих Правил).

            5.7. После успешной регистрации Пользователя на Сайте Администрация принимает на себя права и обязанности
            перед Пользователем, указанные в настоящих Правилах.

            5.8. Обработка персональных данных Пользователя осуществляется в соответствии с законодательством Российской
            Федерации. Администрация Сайта обрабатывает персональные данные Пользователя в целях предоставления
            Пользователю доступа к использованию функциональности Сайта, в том числе в целях получения Пользователем
            таргетированной рекламы; проверки, исследования и анализа таких данных, позволяющих поддерживать и улучшать
            функциональность и разделы Сайта, а также разрабатывать новую функциональность и разделы Сайта.
            Администрация Сайта принимает все необходимые меры для защиты персональных данных Пользователя от
            неправомерного доступа, изменения, раскрытия или уничтожения. Администрация предоставляет доступ к
            персональным данным Пользователя только тем работникам, подрядчикам и агентам Администрации, которым эта
            информация необходима для обеспечения функционирования Сайта и предоставления Пользователю доступа к его
            использованию. Администрация Сайта вправе использовать предоставленную Пользователем информацию, в том числе
            персональные данные, а также передавать ее третьим лицам, в целях обеспечения соблюдения требований
            действующего законодательства Российской Федерации, защиты прав и интересов Пользователей, Администрации
            Сайта, третьих лиц (в том числе в целях выявления, проверки/расследования и/или пресечения противоправных
            действий). Раскрытие предоставленной Пользователем информации может быть произведено лишь в соответствии с
            действующим законодательством Российской Федерации по требованию суда, правоохранительных органов, а равно в
            иных предусмотренных законодательством Российской Федерации случаях. Поскольку Администрация Сайта
            осуществляет обработку персональных данных Пользователя в целях исполнения настоящих Правил, в силу
            положений законодательства о персональных данных согласие Пользователя на обработку его персональных данных
            не требуется.

            5.9. Выбранные Пользователем логин и пароль являются необходимой и достаточной информацией для доступа
            Пользователя на Сайт. Пользователь не имеет права передавать свои логин и пароль третьим лицам, несет полную
            ответственность за их сохранность, самостоятельно выбирая способ их хранения. Пользователь на используемом
            им аппаратно-программном обеспечении может разрешить хранение логина и пароля (с использованием файлов
            cookies) для последующей автоматической авторизации на Сайте.

            5.10. Если Пользователем не доказано обратное, любые действия, совершенные с использованием его логина и
            пароля, считаются совершенными соответствующим Пользователем. В случае несанкционированного доступа к логину
            и паролю и/или персональной странице Пользователя, или распространения логина и пароля Пользователь обязан
            незамедлительно сообщить об этом Администрации Сайта в установленном порядке.

            5.11. После регистрации Пользователь получает право самостоятельно в личных целях создавать, использовать и
            определять содержание собственной персональной страницы и условия доступа других Пользователей к ее
            содержанию, а также получает возможности доступа и размещения информации на персональных страницах других
            Пользователей (при условии получения соответствующих прав доступа от их обладателей), использования
            социальных виджетов ВКонтакте на сторонних сайтах без дополнительной авторизации. При использовании
            социальных виджетов Пользователем сторонним сайтам не предоставляются данные о логине и пароле Пользователя,
            а также его данные, защищенные настройками приватности.

            5.12. Пользователь как обладатель информации, размещённой на собственной персональной странице, осознаёт,
            что за исключением случаев, установленных настоящими Правилами и действующим законодательством Российской
            Федерации, Администрация Сайта не принимает участие в формировании и использовании содержания и контроле
            доступа других пользователей к персональной странице Пользователя. Размещая информацию на персональной
            странице, в том числе свои персональные данные, Пользователь осознаёт и соглашается с тем, что указанная
            информация может быть доступна другим пользователям сети Интернет с учетом особенностей архитектуры и
            функциональности Сайта.

        </Box>
    );
};